иб/src/DataProcessors/ЗагрузкаГеновТомата/ЗагрузкаГеновТомата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаГеновТомата</name>
</mdclass:DataProcessor>

иб/src/Catalogs/СписокГеновТомата/СписокГеновТомата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СписокГеновТомата</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>GeneName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>110</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Allele</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>110</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AlleleName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>110</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Synonyms</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>110</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Phenotype</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>110</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Notes</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>About</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаГенов</name>
    <attributes>
      <name>Gene</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>110</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GeneName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>110</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Allele</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>110</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AlleleName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>110</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Synonyms</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>110</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Phenotype</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>110</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Notes</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>About</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

иб/src/DataProcessors/ЗагрузкаГеновТомата/Forms/Форма/Module.bsl
&НаСервере
Процедура ЗагрузитьНаСервере()
	
	ТабДок = Обработки.ЗагрузкаГеновТомата.ПолучитьМакет("Макет");
	
	СчСтрок = 1;
	
	Пока Истина Цикл
		
		Если ПустаяСтрока(ТабДок.Область(СчСтрок,1).Текст) Тогда
			Прервать;
		КонецЕсли;
		
		НовыйОбъект = Справочники.СписокГеновТомата.СоздатьЭлемент();
		НовыйОбъект.Наименование = ТабДок.Область(СчСтрок,1).Текст;
		НовыйОбъект.GeneName= ТабДок.Область(СчСтрок,2).Текст;
		НовыйОбъект.Allele= ТабДок.Область(СчСтрок,3).Текст;
	    НовыйОбъект.AlleleName= ТабДок.Область(СчСтрок,4).Текст;
	    НовыйОбъект.Synonyms = ТабДок.Область(СчСтрок,5).Текст;
		НовыйОбъект.Phenotype= ТабДок.Область(СчСтрок,6).Текст;
		НовыйОбъект.Notes= ТабДок.Область(СчСтрок,7).Текст;
		НовыйОбъект.About= ТабДок.Область(СчСтрок,9).Текст;
			     	
		НовыйОбъект.Записать();
		
		СчСтрок = СчСтрок + 1;
		
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура загрузить(Команда)
	ЗагрузитьНаСервере();

КонецПроцедуры
